<template lang="pug">
  .wrapper
    .animated.fadeIn
      b-row
        b-col
          b-card(
            header-tag="header"
            footer-tag="footer"
            )
            div(slot="header")
              i.fa.fa-align-justify
              strong 需要予測グラフ
            div
              bar-example(
                v-bind:items="items"
                chartId="chart-bar-01"
                )
        b-col
          b-card(
            header-tag="header"
            footer-tag="footer"
            )
            div(slot="header")
              i.fa.fa-align-justify
              strong 需要予測表
            div
              b-table(
                hover
                striped
                bordered
                small
                fixed
                xs
                v-bind:items='items'
                )
                template(slot='status', slot-scope='data')
                  b-badge(:variant='getBadge(data.item.status)') {{data.item.status}}
</template>

<script>
import BarExample from './charts/BarExample'
export default {
  components: {
    BarExample
  },
  data() {
    return {
      items: [
        {"時刻": "00:00", "今回予測": 100, "速報値": 120, "算術平均": 120, "AI30H": 100, "AI18H": 110, "INV": -100, "INV30": -10, "INV18": -20},
        {"時刻": "00:30", "今回予測": 100, "速報値": 120, "算術平均": 120, "AI30H": 100, "AI18H": 110, "INV": -100, "INV30": -10, "INV18": -20},
        {"時刻": "01:00", "今回予測": 100, "速報値": 120, "算術平均": 120, "AI30H": 100, "AI18H": 110, "INV": -100, "INV30": -10, "INV18": -20},
        {"時刻": "01:30", "今回予測": 100, "速報値": 120, "算術平均": 120, "AI30H": 100, "AI18H": 110, "INV": -100, "INV30": -10, "INV18": -20},
        {"時刻": "02:00", "今回予測": 100, "速報値": 120, "算術平均": 120, "AI30H": 100, "AI18H": 110, "INV": -100, "INV30": -10, "INV18": -20},
        {"時刻": "02:30", "今回予測": 100, "速報値": 120, "算術平均": 120, "AI30H": 100, "AI18H": 110, "INV": -100, "INV30": -10, "INV18": -20},
        {"時刻": "03:00", "今回予測": 100, "速報値": 120, "算術平均": 120, "AI30H": 100, "AI18H": 110, "INV": -100, "INV30": -10, "INV18": -20},
        {"時刻": "03:30", "今回予測": 100, "速報値": 120, "算術平均": 120, "AI30H": 100, "AI18H": 110, "INV": -100, "INV30": -10, "INV18": -20},
        {"時刻": "04:00", "今回予測": 100, "速報値": 120, "算術平均": 120, "AI30H": 100, "AI18H": 110, "INV": -100, "INV30": -10, "INV18": -20},
        {"時刻": "04:30", "今回予測": 100, "速報値": 120, "算術平均": 120, "AI30H": 100, "AI18H": 110, "INV": -100, "INV30": -10, "INV18": -20},
        {"時刻": "05:00", "今回予測": 100, "速報値": 120, "算術平均": 120, "AI30H": 100, "AI18H": 110, "INV": -100, "INV30": -10, "INV18": -20},
        {"時刻": "05:30", "今回予測": 100, "速報値": 120, "算術平均": 120, "AI30H": 100, "AI18H": 110, "INV": -100, "INV30": -10, "INV18": -20},
        {"時刻": "06:00", "今回予測": 100, "速報値": 120, "算術平均": 120, "AI30H": 100, "AI18H": 110, "INV": -100, "INV30": -10, "INV18": -20},
        {"時刻": "06:30", "今回予測": 100, "速報値": 120, "算術平均": 120, "AI30H": 100, "AI18H": 110, "INV": -100, "INV30": -10, "INV18": -20},
        {"時刻": "07:00", "今回予測": 100, "速報値": 120, "算術平均": 120, "AI30H": 100, "AI18H": 110, "INV": -100, "INV30": -10, "INV18": -20},
        {"時刻": "07:30", "今回予測": 100, "速報値": 120, "算術平均": 120, "AI30H": 100, "AI18H": 110, "INV": -100, "INV30": -10, "INV18": -20},
        {"時刻": "08:00", "今回予測": 100, "速報値": 120, "算術平均": 120, "AI30H": 100, "AI18H": 110, "INV": -100, "INV30": -10, "INV18": -20},
        {"時刻": "08:30", "今回予測": 100, "速報値": 120, "算術平均": 120, "AI30H": 100, "AI18H": 110, "INV": -100, "INV30": -10, "INV18": -20},
        {"時刻": "09:00", "今回予測": 100, "速報値": 120, "算術平均": 120, "AI30H": 100, "AI18H": 110, "INV": -100, "INV30": -10, "INV18": -20},
        {"時刻": "09:30", "今回予測": 100, "速報値": 120, "算術平均": 120, "AI30H": 100, "AI18H": 110, "INV": -100, "INV30": -10, "INV18": -20},
        {"時刻": "10:00", "今回予測": 100, "速報値": 120, "算術平均": 120, "AI30H": 100, "AI18H": 110, "INV": -100, "INV30": -10, "INV18": -20},
        {"時刻": "10:30", "今回予測": 100, "速報値": 120, "算術平均": 120, "AI30H": 100, "AI18H": 110, "INV": -100, "INV30": -10, "INV18": -20},
        {"時刻": "11:00", "今回予測": 100, "速報値": 120, "算術平均": 120, "AI30H": 100, "AI18H": 110, "INV": -100, "INV30": -10, "INV18": -20},
        {"時刻": "11:30", "今回予測": 100, "速報値": 120, "算術平均": 120, "AI30H": 100, "AI18H": 110, "INV": -100, "INV30": -10, "INV18": -20},
        {"時刻": "12:00", "今回予測": 100, "速報値": 120, "算術平均": 120, "AI30H": 100, "AI18H": 110, "INV": -100, "INV30": -10, "INV18": -20},
        {"時刻": "12:30", "今回予測": 100, "速報値": 120, "算術平均": 120, "AI30H": 100, "AI18H": 110, "INV": -100, "INV30": -10, "INV18": -20},
        {"時刻": "13:00", "今回予測": 100, "速報値": 120, "算術平均": 120, "AI30H": 100, "AI18H": 110, "INV": -100, "INV30": -10, "INV18": -20},
        {"時刻": "13:30", "今回予測": 100, "速報値": 120, "算術平均": 120, "AI30H": 100, "AI18H": 110, "INV": -100, "INV30": -10, "INV18": -20},
        {"時刻": "14:00", "今回予測": 100, "速報値": 120, "算術平均": 120, "AI30H": 100, "AI18H": 110, "INV": -100, "INV30": -10, "INV18": -20},
        {"時刻": "14:30", "今回予測": 100, "速報値": 120, "算術平均": 120, "AI30H": 100, "AI18H": 110, "INV": -100, "INV30": -10, "INV18": -20},
        {"時刻": "15:00", "今回予測": 100, "速報値": 120, "算術平均": 120, "AI30H": 100, "AI18H": 110, "INV": -100, "INV30": -10, "INV18": -20},
        {"時刻": "15:30", "今回予測": 100, "速報値": 120, "算術平均": 120, "AI30H": 100, "AI18H": 110, "INV": -100, "INV30": -10, "INV18": -20},
        {"時刻": "16:00", "今回予測": 100, "速報値": 120, "算術平均": 120, "AI30H": 100, "AI18H": 110, "INV": -100, "INV30": -10, "INV18": -20},
        {"時刻": "16:30", "今回予測": 100, "速報値": 120, "算術平均": 120, "AI30H": 100, "AI18H": 110, "INV": -100, "INV30": -10, "INV18": -20},
        {"時刻": "17:00", "今回予測": 100, "速報値": 120, "算術平均": 120, "AI30H": 100, "AI18H": 110, "INV": -100, "INV30": -10, "INV18": -20},
        {"時刻": "17:30", "今回予測": 100, "速報値": 120, "算術平均": 120, "AI30H": 100, "AI18H": 110, "INV": -100, "INV30": -10, "INV18": -20},
        {"時刻": "18:00", "今回予測": 100, "速報値": 120, "算術平均": 120, "AI30H": 100, "AI18H": 110, "INV": -100, "INV30": -10, "INV18": -20},
        {"時刻": "18:30", "今回予測": 100, "速報値": 120, "算術平均": 120, "AI30H": 100, "AI18H": 110, "INV": -100, "INV30": -10, "INV18": -20},
        {"時刻": "19:00", "今回予測": 100, "速報値": 120, "算術平均": 120, "AI30H": 100, "AI18H": 110, "INV": -100, "INV30": -10, "INV18": -20},
        {"時刻": "19:30", "今回予測": 100, "速報値": 120, "算術平均": 120, "AI30H": 100, "AI18H": 110, "INV": -100, "INV30": -10, "INV18": -20},
        {"時刻": "20:00", "今回予測": 100, "速報値": 120, "算術平均": 120, "AI30H": 100, "AI18H": 110, "INV": -100, "INV30": -10, "INV18": -20},
        {"時刻": "20:30", "今回予測": 100, "速報値": 120, "算術平均": 120, "AI30H": 100, "AI18H": 110, "INV": -100, "INV30": -10, "INV18": -20},
        {"時刻": "21:00", "今回予測": 100, "速報値": 120, "算術平均": 120, "AI30H": 100, "AI18H": 110, "INV": -100, "INV30": -10, "INV18": -20},
        {"時刻": "21:30", "今回予測": 100, "速報値": 120, "算術平均": 120, "AI30H": 100, "AI18H": 110, "INV": -100, "INV30": -10, "INV18": -20},
        {"時刻": "22:00", "今回予測": 100, "速報値": 120, "算術平均": 120, "AI30H": 100, "AI18H": 110, "INV": -100, "INV30": -10, "INV18": -20},
        {"時刻": "22:30", "今回予測": 100, "速報値": 120, "算術平均": 120, "AI30H": 100, "AI18H": 110, "INV": -100, "INV30": -10, "INV18": -20},
        {"時刻": "23:00", "今回予測": 100, "速報値": 120, "算術平均": 120, "AI30H": 100, "AI18H": 110, "INV": -100, "INV30": -10, "INV18": -20},
        {"時刻": "23:30", "今回予測": 100, "速報値": 120, "算術平均": 120, "AI30H": 100, "AI18H": 110, "INV": -100, "INV30": -10, "INV18": -20}
      ]
    }
  }
}
</script>

